# GetPlantToolSpacing

## Description
This returns the spacing that is currently stored in the plant tool.

```pascal
FUNCTION GetPlantToolSpacing : REAL;
```

```python

def vs.GetPlantToolSpacing():
    return REAL
```

## Version
Availability: from VectorWorks 2008
## Category
* Utility